Config/InformationRegisters/ОбъектыЗапрещенныеКПовторнойЗагрузкеВД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыЗапрещенныеКПовторнойЗагрузкеВД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗагруженныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификаторИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ОперацииДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОперацииДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСторнирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПроводки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлениеОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокИсправленияОшибокПрошлыхЛет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыявительОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВыявительОшибокПрошлыхЛет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОшибки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОшибокПрошлыхЛет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/СостоянияОперацииДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияОперацииДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОперацияНеВыбрана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроводкиОтсутствуют</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроводкиСформированы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроводкиИзмененыВручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументСторнирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсправлениеОшибки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ПорядокИсправленияОшибокПрошлыхЛет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПорядокИсправленияОшибокПрошлыхЛет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПрошлогоГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаРанееПрошлогоГода</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/InformationRegisters/ОбъектыЗапрещенныеКПовторнойЗагрузкеВД/Forms/РедактированиеСпискаОбъектов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.СоответствияОбъектовИнформационныхБаз) Тогда
		ТекстИсключения = НСтр("ru = 'Для работы со списком объектов, запрещенных к повторной загрузке из Вещевого довольствия не хватает прав.
			|Необходимые права предоставляются в дополнительном профиле доступа ""Изменение списка объектов, запрещенных к повторной загрузке из Вещевого довольствия""'");
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Доступ. Отказ в доступе'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.СоответствияОбъектовИнформационныхБаз,
			,
			ТекстИсключения);
		
		ВызватьИсключение(ТекстИсключения, КатегорияОшибки.НарушениеПравДоступа);
	КонецЕсли;
	ОткрытиеИзНастройкиСинхронизации = Параметры.ОткрытиеИзНастройкиСинхронизации;
	УстановитьЗапросДинамическогоСписка();
	ЗаполнитьСписокТиповДокументов();
	УстановитьНачальноеЗначениеОтбора();
	ПрименитьВсеОтборы();
	Элементы.НастройкаСинхронизации.СписокВыбора.ЗагрузитьЗначения(ДопустимыеКонвертацииДанных());	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "РегистрацияЗапретаПовторнойЗагрузкиОбъектаВД" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	// Если форма открывается из настройки синхронизации, то не нужно использовать сохраненные настройки.
	// Изменения настроек не нужно сохранять. Для этого ранее сохраненные настройки сохраняются в данных формы.
	Если ОткрытиеИзНастройкиСинхронизации Тогда
		СохраненныеНастройкиПользователя = ОбщегоНазначения.СкопироватьРекурсивно(Настройки, Истина);
		Настройки.Очистить();
	Иначе
		УстановитьОтборПоТекущейОрганизации();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ПрименитьВсеОтборы();
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	// Если форма открывается из настройки синхронизации, то не нужно сохранять текущие настройки.
	// Нужно сохранить настройки, которые были получены при открытии формы.
	Если ОткрытиеИзНастройкиСинхронизации И СохраненныеНастройкиПользователя <> Неопределено Тогда
		Настройки.Очистить();
		Для Каждого КлючИЗначение Из СохраненныеНастройкиПользователя Цикл
			Настройки.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодИспользованиеПриИзменении(Элемент)
	ПриИзмененииИспользованияОтбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПриИзмененииЗначенияОтбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСинхронизацииИспользованиеПриИзменении(Элемент)
	ПриИзмененииИспользованияОтбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСинхронизацииПриИзменении(Элемент)
	ПриИзмененииЗначенияОтбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияИспользованиеПриИзменении(Элемент)
	ПриИзмененииИспользованияОтбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияСписокПриИзменении(Элемент)
	ПриИзмененииЗначенияОтбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентИспользованиеПриИзменении(Элемент)
	ПриИзмененииИспользованияОтбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ПриИзмененииЗначенияОтбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЦМОПолучательИспользованиеПриИзменении(Элемент)
	ПриИзмененииИспользованияОтбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЦМОПолучательПриИзменении(Элемент)
	ПриИзмененииЗначенияОтбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЦМООтправительИспользованиеПриИзменении(Элемент)
	ПриИзмененииИспользованияОтбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЦМООтправительПриИзменении(Элемент)
	ПриИзмененииЗначенияОтбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаИспользованиеПриИзменении(Элемент)
	ПриИзмененииИспользованияОтбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	ПриИзмененииЗначенияОтбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура СостояниеОперацииИспользованиеПриИзменении(Элемент)
	ПриИзмененииИспользованияОтбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура СостояниеОперацииПриИзменении(Элемент)
	ПриИзмененииЗначенияОтбора(Элемент.Имя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ОткрытьНастройкуОбъекта();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьНастройкуОбъекта();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ДопустимыеКонвертацииДанных()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбменВДБГУ2.Ссылка
	|ИЗ
	|	ПланОбмена.ОбменВДБГУ2 КАК ОбменВДБГУ2
	|ГДЕ
	|	ОбменВДБГУ2.Ссылка <> &ЭтотУзел";
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменВДБГУ2.ЭтотУзел());
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

&НаСервере
Процедура УстановитьОтборПоТекущейОрганизации()
	Если Параметры.СписокОрганизаций.Количество() > 0 Тогда
		ОрганизацияСписок.ЗагрузитьЗначения(Параметры.СписокОрганизаций.ВыгрузитьЗначения());
	Иначе
		Организация = ОбщегоНазначенияБГУ.ТекущаяОрганизация();
		Если ЗначениеЗаполнено(Организация) Тогда
			ОрганизацияСписок.Очистить();
			ОрганизацияСписок.Добавить(Организация);
		КонецЕсли;
	КонецЕсли;
	ОрганизацияИспользование = ЗначениеЗаполнено(ОрганизацияСписок);
КонецПроцедуры

&НаСервере
Процедура ПрименитьВсеОтборы()
	ПоляОтборов = Новый Массив;
	ПоляОтборов.Добавить("Период");
	ПоляОтборов.Добавить("Контрагент");
	ПоляОтборов.Добавить("НастройкаСинхронизации");
	ПоляОтборов.Добавить("ОрганизацияСписок");
	ПоляОтборов.Добавить("СостояниеОперации");
	ПоляОтборов.Добавить("ТипДокумента");
	ПоляОтборов.Добавить("ЦМООтправитель");
	ПоляОтборов.Добавить("ЦМОПолучатель");
	Для Каждого ПолеОтбора Из ПоляОтборов Цикл
		УстановитьОтбор(ЭтотОбъект, ПолеОтбора);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНачальноеЗначениеОтбора()
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = Новый СтандартныйПериод(НачалоМесяца(ТекущаяДатаСеанса()), КонецМесяца(ТекущаяДатаСеанса()));
	КонецЕсли;
	ПериодИспользование = ЗначениеЗаполнено(Период);
	УстановитьОтборПоТекущейОрганизации();
	Если Не Параметры.НастройкаСинхронизации.Пустая() Тогда
		НастройкаСинхронизации = Параметры.НастройкаСинхронизации;
		НастройкаСинхронизацииИспользование = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокТиповДокументов()
	ТипыДокументов = Справочники.ОперацииУчетаВещевогоДовольствия
		.ДопустимыеВидыДокументаПоВидуОперации(Неопределено); // Массив из СправочникСсылка.ИдентификаторыОбъектовМетаданных 
	РеквизитыДокументов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ТипыДокументов, "Имя, Синоним");
	Для Каждого КлючИЗначение Из РеквизитыДокументов Цикл
		Элементы.ТипДокумента.СписокВыбора.Добавить(КлючИЗначение.Значение.Имя, КлючИЗначение.Значение.Синоним);
	КонецЦикла;
	Элементы.ТипДокумента.СписокВыбора.СортироватьПоПредставлению();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииИспользованияОтбора(ИмяФлажка)
	УстановитьОтбор(ЭтотОбъект, Лев(ИмяФлажка, СтрДлина(ИмяФлажка) - СтрДлина("Использование")));
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НормализованноеИмяОтбора(ИмяОтбора)
	Если СтрЗаканчиваетсяНа(ИмяОтбора, "Список") Тогда
		Возврат Лев(ИмяОтбора, СтрДлина(ИмяОтбора) - СтрДлина("Список"));
	КонецЕсли;
	Возврат ИмяОтбора;
КонецФункции

&НаКлиенте
Процедура ПриИзмененииЗначенияОтбора(ИмяОтбора)
	Если ЗначениеЗаполнено(ЭтотОбъект[ИмяОтбора]) Тогда
		ЭтотОбъект[НормализованноеИмяОтбора(ИмяОтбора) + "Использование"] = Истина;
	КонецЕсли;
	УстановитьОтбор(ЭтотОбъект, ИмяОтбора);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтбор(Форма, Знач ИмяОтбора)
	Если ИмяОтбора = "Период" Тогда
		ЗначениеОтбора = Форма[ИмяОтбора]; // СтандартныйПериод
		ДатаНачала = ЗначениеОтбора.ДатаНачала;
		ДатаОкончания = ЗначениеОтбора.ДатаОкончания;
		ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(
			Форма.Список.КомпоновщикНастроек.Настройки.Отбор, , НСтр("ru = 'Начало периода'"),
				ДатаНачала, ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
				ЗначениеЗаполнено(ДатаНачала) И Форма[ИмяОтбора + "Использование"],
				РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(
			Форма.Список.КомпоновщикНастроек.Настройки.Отбор, , НСтр("ru = 'Окончание периода'"),
				ДатаОкончания, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
				ЗначениеЗаполнено(ДатаОкончания) И Форма[ИмяОтбора + "Использование"],
				РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	Иначе
		Если ИмяОтбора = "Организация" Тогда
			НормализованноеИмяОтбора = ИмяОтбора;
			ИмяОтбора = ИмяОтбора + "Список";
		Иначе			
			НормализованноеИмяОтбора = НормализованноеИмяОтбора(ИмяОтбора);
		КонецЕсли;
		Если НормализованноеИмяОтбора = "ТипДокумента" Тогда
			Если ЗначениеЗаполнено(Форма[ИмяОтбора]) Тогда
				ЗначениеОтбора = Тип("ДокументСсылка." + Форма[ИмяОтбора]);
			Иначе
				ЗначениеОтбора = Неопределено;
			КонецЕсли;
		Иначе
			ЗначениеОтбора = Форма[ИмяОтбора];
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.Список,
			НормализованноеИмяОтбора, ЗначениеОтбора, , , Форма[НормализованноеИмяОтбора + "Использование"],
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуОбъекта()
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УникальныйИдентификаторИсточника", ТекущиеДанные.УникальныйИдентификаторПриемника);
	ОткрытьФорму("РегистрСведений.ОбъектыЗапрещенныеКПовторнойЗагрузкеВД.ФормаЗаписи", ПараметрыФормы);
КонецПроцедуры

&НаСервере
Процедура УстановитьЗапросДинамическогоСписка()
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СоответствияОбъектовПереопределяемый.УникальныйИдентификаторИсточника,
	|	СоответствияОбъектовПереопределяемый.УзелИнформационнойБазы КАК НастройкаСинхронизации,
	|	СоответствияОбъектовПереопределяемый.УникальныйИдентификаторПриемника,
	|	ВЫБОР
	|		КОГДА ЗапрещенныеОбъекты.ЗагруженныйОбъект ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЗапретУстановлен,
	|	&ПолеДата КАК Дата,
	|	&ПолеНомер КАК Номер,
	|	&ПолеОрганизация КАК Организация,
	|	&ПолеПометкаУдаления КАК ПометкаУдаления,
	|	&ПолеПроведен КАК Проведен,
	|	&ПолеКонтрагент КАК Контрагент,
	|	&ПолеЦМООтправитель КАК ЦМООтправитель,
	|	&ПолеЦМОПолучатель КАК ЦМОПолучатель,
	|	&ПолеКомментарий КАК Комментарий,
	|	ТИПЗНАЧЕНИЯ(СоответствияОбъектовПереопределяемый.УникальныйИдентификаторИсточника) КАК ТипДокумента,
	|	ВЫБОР
	|		КОГДА ОперацииДокументов.ЕстьПроводки ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОперацииДокумента.ОперацияНеВыбрана)
	|		КОГДА НЕ ОперацииДокументов.ЕстьПроводки
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОперацииДокумента.ПроводкиОтсутствуют)
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.ДокументСторнирован, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОперацииДокумента.ДокументСторнирован)
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.РучнаяКорректировка, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОперацииДокумента.ПроводкиИзмененыВручную)
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.ИсправлениеОшибки, ЗНАЧЕНИЕ(Перечисление.ПорядокИсправленияОшибокПрошлыхЛет.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Перечисление.ПорядокИсправленияОшибокПрошлыхЛет.ОшибкаПрошлогоГода), ЗНАЧЕНИЕ(Перечисление.ПорядокИсправленияОшибокПрошлыхЛет.ОшибкаРанееПрошлогоГода))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОперацииДокумента.ИсправлениеОшибки)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОперацииДокумента.ПроводкиСформированы)
	|	КОНЕЦ КАК СостояниеОперации,
	|	ОперацииДокументов.ЕстьПроводки КАК ЕстьПроводки,
	|	ОперацииДокументов.ДокументСторнирован КАК ДокументСторнирован,
	|	ОперацииДокументов.РучнаяКорректировка КАК РучнаяКорректировка,
	|	ОперацииДокументов.ИсправлениеОшибки КАК ИсправлениеОшибки
	|	
	|ИЗ
	|	РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовПереопределяемый
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыЗапрещенныеКПовторнойЗагрузкеВД КАК ЗапрещенныеОбъекты
	|		ПО СоответствияОбъектовПереопределяемый.УникальныйИдентификаторИсточника = ЗапрещенныеОбъекты.ЗагруженныйОбъект
	|		И СоответствияОбъектовПереопределяемый.УникальныйИдентификаторПриемника = ЗапрещенныеОбъекты.УникальныйИдентификаторИсточника
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|		ПО СоответствияОбъектовПереопределяемый.УникальныйИдентификаторИсточника = ОперацииДокументов.Документ
	|ГДЕ
	|	&ОсновноеУсловие";
	РегистрыСведений.ОбъектыЗапрещенныеКПовторнойЗагрузкеВД.ЗаполнитьПоляДокументовВТекстеЗапроса(
		ТекстЗапроса, "СоответствияОбъектовПереопределяемый.УникальныйИдентификаторИсточника");
	ЧастиУсловия = Новый Массив;
	СвойстваМетаданных = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
		Справочники.ОперацииУчетаВещевогоДовольствия.ДопустимыеВидыДокументаПоВидуОперации(Неопределено),
		"ПолноеИмя");
	Для Каждого СвойствоМетаданного Из СвойстваМетаданных Цикл
		ЧастиУсловия.Добавить("СоответствияОбъектовПереопределяемый.УникальныйИдентификаторИсточника ССЫЛКА "
			+ СвойствоМетаданного.Значение);
	КонецЦикла;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОсновноеУсловие", СтрСоединить(ЧастиУсловия, " ИЛИ "));
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
	
КонецПроцедуры

#КонецОбласти
